{"id":31357,"date":"2021-07-16T10:34:19","date_gmt":"2021-07-16T05:04:19","guid":{"rendered":"https:\/\/www.squareyards.com\/blog\/?p=31357"},"modified":"2021-07-16T10:34:24","modified_gmt":"2021-07-16T05:04:24","slug":"a-complete-guide-to-all-you-need-to-know-about-a-share-certificate","status":"publish","type":"post","link":"https:\/\/www.squareyards.com\/blog\/a-complete-guide-to-all-you-need-to-know-about-a-share-certificate","title":{"rendered":"A Complete Guide to All you Need to Know About a Share Certificate"},"content":{"rendered":"\n<p class=\"has-text-align-justify\">Societies are often stringent about keeping accurate records and paperwork. The managing committees of a housing society have the key responsibility of ensuring that all the proof of sale towards the property is rightfully issued. A<strong>&nbsp;share certificate<\/strong>, quite like the sale deed is proper proof that the rightful owner of the said property must possess.&nbsp;<\/p>\n\n\n\n<p class=\"has-text-align-justify\">Sometimes,&nbsp;<strong>housing society members&nbsp;<\/strong>tend to overlook or forget to issue these share certificates to the members which can be a problem in case a property-related issue occurs. While the sale deed does act as proof that you are the official owner of the property, a share certificate is legal proof of the same and is indispensable. The managing committee must ensure you have this but in case you do not have one, you can obtain one with ease.&nbsp;<\/p>\n\n\n\n<h2 id=\"h-what-is-a-share-certificate\"><strong>What is a Share Certificate?&nbsp;<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-justify\">In simple terms, a&nbsp;<strong>share certificate<\/strong>&nbsp;is a legal document or certification provided by a cooperative&nbsp;<strong>housing society<\/strong>&nbsp;to the registered owner of the flat. This is given to the member at no cost and ideally, should be given within six months from the time of&nbsp;<strong>allotment of the shares in the housing society&nbsp;<\/strong>as per the number of shares subscribed by him\/her. This share certificate is an active proof of ownership and should have the name of the said housing society, a distinctive number, number of shares allotted to the member as well as value paid after that. The&nbsp;<strong>share certificate<\/strong>&nbsp;is free, and the registrar then decided the total authorized value at the time the society has been registered. In an event that the member has cleared all his or her dues and no other hitches are existing, the denial of a share certificate can entitle the member to take legal action against the cooperative&nbsp;<strong>housing society<\/strong>.&nbsp;<\/p>\n\n\n\n<h2 id=\"h-why-do-you-need-a-share-certificate\"><strong>Why do you need a Share Certificate?&nbsp;<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-justify\">A&nbsp;<strong>share certificate<\/strong>&nbsp;is an indispensable document that solely acts as actual legal proof of ownership to the property and the shareholding within the society. The sale deed is also an important document, but the share certificate trumps that in case of official demand. This answer the question of&nbsp;<strong>what is a share certificate and why do you need it<\/strong>.&nbsp;<\/p>\n\n\n\n<h2 id=\"h-a-checklist-for-the-issuance-of-a-share-certificate\"><strong>A Checklist for the Issuance of a Share Certificate&nbsp;<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-justify\"><strong>What to check before\/after getting a share certificate&nbsp;<\/strong>is stated below and should be well kept in mind.&nbsp;<\/p>\n\n\n\n<ul><li>The&nbsp;<strong>share certificate<\/strong>&nbsp;must be collected by the member in person himself\/herself.&nbsp;<\/li><li>There should be no dues or penalties on the member&#8217;s property. In case there are any, they should be immediately paid up.&nbsp;<\/li><li>An important document called the &#8216;conveyance deed&#8217; that is issued by the builder should be in the possession of the&nbsp;<strong>housing society<\/strong>.&nbsp;<\/li><li>The&nbsp;<strong>share certificate<\/strong>&nbsp;should be signed by the secretary, chairman, and any other member of the managing committee along with the official seal of the&nbsp;<strong>housing society<\/strong>.&nbsp;<\/li><li>The share certificate should be authorized by the managing committee first and only then issued by the secretary.&nbsp;<\/li><li>The housing society will demand that you give an<strong>&nbsp;indemnity bond<\/strong>&nbsp;which means that under no circumstances should the allotted shares be transferred to any individual or entity for any purpose whatsoever.&nbsp;<\/li><li>The names on the&nbsp;<strong>share certificate<\/strong>&nbsp;should be exactly in the same order as it appears on the original sale agreement between the builder and the member. This includes primary as well as associate members.&nbsp;<\/li><li>The member will need to indemnify the cooperative housing society against any loans and complete any incomplete paperwork before the&nbsp;<strong>share certificate<\/strong>&nbsp;can be issued.&nbsp;<\/li><li>No typos or spelling errors should be there in the name and other content on the sale deed. With this you can stay away from any issues that can arrive in future.<\/li><li>While collecting the&nbsp;<strong>share certificate<\/strong>, the member will need to present the original sale deed.&nbsp;<\/li><li>Ensure that after you collect the&nbsp;<strong>share certificate<\/strong>, all the required signatures as per the society members, official seal, etc. are present on it.&nbsp;<\/li><\/ul>\n\n\n\n<h2 id=\"h-transferring-of-share-certificate-in-case-of-resale\"><strong>Transferring of Share Certificate in Case of Resale<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-justify\">Certain norms need to be followed in case of a resale. In such a scenario, the original&nbsp;<strong>share certificate&nbsp;<\/strong>will have to be given to the housing society along with any other documents as needed. In case the share certificate is being transferred in the name of the new member of the housing society after the resale, all procedures about the transfer of the share certificate will need to be made prior to any finalization. The following mentioned points should be kept in mind under such a circumstance.<\/p>\n\n\n\n<ul><li>The new member will need to pay the premium for the transfer of the share certificate.&nbsp;<\/li><li>The new member will have to make sure that all dues should be cleared by the previous owner of the property.&nbsp;<\/li><li>The new member will need to produce all the documents and necessary applications required by the&nbsp;<strong>housing society<\/strong>. These documents and applications should be in mint condition.&nbsp;<\/li><li>In an event that the original member dies, his or her consequent heirs will have to make an application for the share transfer to the appointed nominee and a new share certificate will have to be obtained.&nbsp;<\/li><li>The new share certificate should be issued by the cooperative&nbsp;<strong>housing society<\/strong>&nbsp;within the stipulated time, a lack of which can allow the member to take necessary legal action.<\/li><li>Readymade&nbsp;<strong>share certificate&nbsp;<\/strong>booklets are readily available online. Moreover, you can get them at book printing agencies as well as housing federation offices.&nbsp;<\/li><\/ul>\n\n\n\n<h2 id=\"h-issuance-of-a-duplicate-share-certificate\"><strong>Issuance of a Duplicate Share Certificate&nbsp;<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-justify\">Just as in the case of any important document, it is advisable to keep the original copy of the&nbsp;<strong>share certificate<\/strong>&nbsp;in a safe place and a proper condition. If you damage or lose this, getting a duplicate is not a simple task. However, it is difficult but not impossible. You can request the&nbsp;<strong>housing society members<\/strong>&nbsp;to issue you a new one and for this, you will need to follow the steps mentioned below.<\/p>\n\n\n\n<p class=\"has-text-align-justify\"><strong>Step 1<\/strong>&nbsp;– The very first thing you will need to do is visit the local police station within your jurisdiction and file an FIR. You will need to add all the details in a registering report that will include details of whether the certificate is lost, damaged, misplaced, stolen, etc. Once this is done, you will need to retain the FIR acknowledgment by the police as you will need it for future communication and reference.<\/p>\n\n\n\n<p class=\"has-text-align-justify\"><strong>Step 2<\/strong>&nbsp;– Once the FIR is complete, you will then need to inform the housing society members of this mishap. For this, you will be required to send a written application to them in which you will request them to issue you a new duplicate share certificate. This application will also need to have the details of what happened to the original copy. (i.e whether it is stolen, lost, misplaced, damaged, untraceable, etc.) You will also need to attach the FIR acknowledgment copy that you will have received after filing the FIR. (First Information Report).&nbsp;<\/p>\n\n\n\n<p class=\"has-text-align-justify\"><strong>Step 3&nbsp;<\/strong>– After step 2, you will need to submit an&nbsp;<strong>indemnity bond<\/strong>&nbsp;of Rs. 200 to the cooperative housing society. This will clear the society of all costs resulting due to the issuance of the new duplicate&nbsp;<strong>share certificate<\/strong>. All costs that arise for this procedure will have to be borne by the member himself\/herself. Make sure that this indemnity bond is officially notarized and attach the FIR acknowledgment copy along with it.&nbsp;<\/p>\n\n\n\n<p class=\"has-text-align-justify\"><strong>Step 4 –&nbsp;<\/strong>Once the above-mentioned steps are complete, the managing committee will then review your application along with all the attached paperwork in the next general body meeting in which they will decide whether they want to approve or disapprove your request.&nbsp;<\/p>\n\n\n\n<p class=\"has-text-align-justify\"><strong>Step 5 –&nbsp;<\/strong>If your request is approved, the housing society will then display a notice on the main notice board of the society so that all other members can have a look. Additionally, the society will also publish notices in at least two newspapers. All of this will be in regards to the issuing of a duplicate share certificate, the cost of which will need to be paid by the applicant.&nbsp;<\/p>\n\n\n\n<p class=\"has-text-align-justify\"><strong>Step 6 –&nbsp;<\/strong>You along with the society will have to wait for a minimum of 15 days to see if any objections are made.&nbsp;<\/p>\n\n\n\n<p class=\"has-text-align-justify\"><strong>Step 7 –&nbsp;<\/strong>If everything goes smoothly, and no objections are made, the housing society will then issue a new duplicate share certificate to you which you will have to collect in person when ready.&nbsp;<\/p>\n\n\n\n<p class=\"has-text-align-justify\">So if you have lost or misplaced your original copy and are asking yourself, &#8216;<strong>Can I get a duplicate one?<\/strong>&#8221; the above-mentioned procedure will help you with the same.  The ownership of a share certificate is extremely important for a property owner in a cooperative housing society. It does not only act as a legal document for your rights but also proves the allotment of shares of that society in your name. Without this share certificate, you can face issues in the future such as transferring the property to the rightful heirs, involvement or rights in any social events, police aid in case of crime, and many other such issues that may occur. Fortunately, even if the<strong> housing society<\/strong> has forgotten to issue this share certificate to you, you can now get it at any time from them. This article has dotted all the i&#8217;s and cross all the t&#8217;s with its information on the importance of a share certificate. If you have your original copy, ensure you keep it safe and in case you don&#8217;t, go and get it today! <\/p>\n\n\n\n<h2 id=\"h-you-might-also-like\">You Might Also Like<\/h2>\n\n\n\n<ul class=\"wp-block-yoast-seo-related-links\"><li><a href=\"https:\/\/www.squareyards.com\/blog\/cooperative-housing-society\">Cooperative Housing Society: Pros and Cons of Residing in it<\/a><\/li><li><a href=\"https:\/\/www.squareyards.com\/blog\/society-maintenance-charges-maharashtra\">Society Maintenance charges in Maharashtra: Your handy calculation blueprint<\/a><\/li><li><a href=\"https:\/\/www.squareyards.com\/blog\/5-important-real-estate-documents-worth-keeping-and-why\">5 Important Real Estate Documents Worth Keeping and Why<\/a><\/li><li><a href=\"https:\/\/www.squareyards.com\/blog\/best-societies-in-noida\">5 Best Societies in Noida<\/a><\/li><li><a href=\"https:\/\/www.squareyards.com\/blog\/year-ender-2020-revisit-the-top-regulatory-policies-of-2020\">Year Ender 2020: Revisit the Top Regulatory Policies of 2020<\/a><\/li><\/ul>\n\n\n\n<h2 id=\"h-frequently-asked-questions-faqs\">Frequently Asked Questions (FAQs)<\/h2>\n\n\n        <section class=\"sc_fs_faq sc_card\">\n            <div>\n\t\t\t\t<h2>In case I request for a duplicate certificate and objections are raised, what happens then?<\/h2>                <div>\n\t\t\t\t\t                    <p>\n\t\t\t\t\t\tUnfortunately, the issuance of a duplicate share certificate is not as easy as getting the original one. More often than not, no one objects, but for some reason, if someone has a valid reason to raise one, the matter will then need to be taken up in court. You will need to fight a case for this in that case                    <\/p>\n                <\/div>\n            <\/div>\n        <\/section>\n\t        <section class=\"sc_fs_faq sc_card\">\n            <div>\n\t\t\t\t<h2> I am a nominee in the house my father owns. Does this mean I am automatically the owner? <\/h2>                <div>\n\t\t\t\t\t                    <p>\n\t\t\t\t\t\tYou are liable to be the owner once your dad passes away unless he chooses to do so before his demise. In either case, your dad, in this case, will need to transfer the share certificate in your name by taking the help of the housing society and following the official procedures. In case he does meet his end, you will then need to take up this procedure yourself and get the share certificate transferred in your name, making you the official owner. You must be a legally appointed nominee.                    <\/p>\n                <\/div>\n            <\/div>\n        <\/section>\n\t        <section class=\"sc_fs_faq sc_card\">\n            <div>\n\t\t\t\t<h2>What does a conveyance deed mean?<\/h2>                <div>\n\t\t\t\t\t                    <p>\n\t\t\t\t\t\tA conveyance deed is an official\/legal document that proves ownership rights of the specific property in question. This deed allows the builder to transfer all ownership rights to the cooperative housing society.                    <\/p>\n                <\/div>\n            <\/div>\n        <\/section>\n\t        <section class=\"sc_fs_faq sc_card\">\n            <div>\n\t\t\t\t<h2>What is the value of the shares allotted to me?<\/h2>                <div>\n\t\t\t\t\t                    <p>\n\t\t\t\t\t\tThe registrar will decide the value of the shares. This is usually done by dividing the total authorized capital by Rs. 50 per share. The share certificates are distributed based on this. E.g., for every ten shares, the property member gets shares worth Rs. 500                    <\/p>\n                <\/div>\n            <\/div>\n        <\/section>\n\t        <section class=\"sc_fs_faq sc_card\">\n            <div>\n\t\t\t\t<h2>Is it a tedious task to get a duplicate? <\/h2>                <div>\n\t\t\t\t\t                    <p>\n\t\t\t\t\t\tYou shouldn&#8217;t lose the original share certificate as the duplicate, while not tedious, can be a long-drawn procedure that will involve you making rounds of the police station, housing society offices, and even court if there are disapprovals.                    <\/p>\n                <\/div>\n            <\/div>\n        <\/section>\n\t\n<script type=\"application\/ld+json\">\n    {\n        \"@context\": \"https:\/\/schema.org\",\n        \"@type\": \"FAQPage\",\n        \"mainEntity\": [\n                    {\n                \"@type\": \"Question\",\n                \"name\": \"In case I request for a duplicate certificate and objections are raised, what happens then?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"Unfortunately, the issuance of a duplicate share certificate is not as easy as getting the original one. More often than not, no one objects, but for some reason, if someone has a valid reason to raise one, the matter will then need to be taken up in court. You will need to fight a case for this in that case\"\n                                    }\n            }\n            ,\t            {\n                \"@type\": \"Question\",\n                \"name\": \" I am a nominee in the house my father owns. Does this mean I am automatically the owner? \",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"You are liable to be the owner once your dad passes away unless he chooses to do so before his demise. In either case, your dad, in this case, will need to transfer the share certificate in your name by taking the help of the housing society and following the official procedures. In case he does meet his end, you will then need to take up this procedure yourself and get the share certificate transferred in your name, making you the official owner. You must be a legally appointed nominee.\"\n                                    }\n            }\n            ,\t            {\n                \"@type\": \"Question\",\n                \"name\": \"What does a conveyance deed mean?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"A conveyance deed is an official\/legal document that proves ownership rights of the specific property in question. This deed allows the builder to transfer all ownership rights to the cooperative housing society.\"\n                                    }\n            }\n            ,\t            {\n                \"@type\": \"Question\",\n                \"name\": \"What is the value of the shares allotted to me?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"The registrar will decide the value of the shares. This is usually done by dividing the total authorized capital by Rs. 50 per share. The share certificates are distributed based on this. E.g., for every ten shares, the property member gets shares worth Rs. 500\"\n                                    }\n            }\n            ,\t            {\n                \"@type\": \"Question\",\n                \"name\": \"Is it a tedious task to get a duplicate? \",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"You shouldn't lose the original share certificate as the duplicate, while not tedious, can be a long-drawn procedure that will involve you making rounds of the police station, housing society offices, and even court if there are disapprovals.\"\n                                    }\n            }\n            \t        ]\n    }\n\n<\/script>","protected":false},"excerpt":{"rendered":"<p>Societies are often stringent about keeping accurate records and paperwork. The managing committees of a housing society have the key responsibility of ensuring that all the proof of sale towards the property is rightfully issued. A&nbsp;share certificate, quite like the sale deed is proper proof that the rightful owner of the said property must possess.&nbsp; [&hellip;]<\/p>\n","protected":false},"author":21,"featured_media":31358,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_editorskit_title_hidden":false,"_editorskit_reading_time":0,"_editorskit_typography_data":[],"_editorskit_blocks_typography":""},"categories":[199],"_links":{"self":[{"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/posts\/31357"}],"collection":[{"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/comments?post=31357"}],"version-history":[{"count":2,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/posts\/31357\/revisions"}],"predecessor-version":[{"id":31360,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/posts\/31357\/revisions\/31360"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/media\/31358"}],"wp:attachment":[{"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/media?parent=31357"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/categories?post=31357"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}