{"id":31352,"date":"2021-07-16T10:18:57","date_gmt":"2021-07-16T04:48:57","guid":{"rendered":"https:\/\/www.squareyards.com\/blog\/?p=31352"},"modified":"2021-07-16T10:19:48","modified_gmt":"2021-07-16T04:49:48","slug":"daulatabad-fort-indias-priceless-possession-and-its-significance","status":"publish","type":"post","link":"https:\/\/www.squareyards.com\/blog\/daulatabad-fort-indias-priceless-possession-and-its-significance","title":{"rendered":"Daulatabad Fort: India’s priceless possession and its significance"},"content":{"rendered":"\n<p class=\"has-text-align-justify\">India, with its rich heritage and culture, is home to some of the majestic historical structures. Such structures have been part of the Indian subcontinent for centuries now. &nbsp;It is not just the valuation of the historical structures that are assets for the nation. Their mere existence is a value addition. One of such structures, the <strong>Daulatabad Fort, <\/strong>is the highlight of this particular article.<\/p>\n\n\n\n<p class=\"has-text-align-justify\">This site acts as one of the famous sites to pay a visit to. Located in the state of <strong>Maharashtra, <\/strong>the historic site is also commonly addressed in the names of ‘<strong>Deogiri fort’ <\/strong>or ‘<strong>Devagiri fort’. <\/strong>It lies right in close premises of <strong>Aurangabad,<\/strong> in the village of <strong>Daulatabad. <\/strong>Owing to its majestic size, it has been an important capital to some famous dynasties that once ruled India. Through this article, we would bring about its significance in the Indian subcontinent.<\/p>\n\n\n\n<h2 id=\"h-daulatabad-fort-aurangabad-history\"><strong>Daulatabad fort Aurangabad history<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-justify\">Historians claim that the fort has been in use since 100 BCE. Initially, the remains of temples mainly belonging to the Hindu and Jain structures were found there. Such structures resemble those seen in the forts of Ajanta and Ellora caves of India.&nbsp; The carvings found in it are mostly that of Jain Tirthankara.<\/p>\n\n\n\n<p class=\"has-text-align-justify\">Bhillama V, who was a Yadava prince in 1187, is considered the founder who discovered the fort while establishing their superiority in the western region. The primary aim of the Yadava dynasty was to outdo the Chalukyas rulers. The rulers of the Yadava dynasty have faced several invasions during their rule in the western region.<\/p>\n\n\n\n<p class=\"has-text-align-justify\">Right when the kingdom was under the rule of king Ramachandra, Allaudin Khilji, the great ruler from the Khilji dynasty, made attempts to raid the fort. In 1296, the Khiljis placed their first attempt at a raid. Owing to the crisis, the Yadava dynasty started paying tributes to the actions of the king of the Delhi Sultanate.<\/p>\n\n\n\n<h2 id=\"h-establishment-of-the-daulatabad-fort\"><strong>Establishment of the Daulatabad Fort<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-justify\">In the year 1308, a second attempt of the raid was made by the Khilji to the king Ramachandran. This time, it was even more fierce. Allaudin proposed to bring down the Yadava rulers and thus making king Ramachandran subordinate to himself. Later, in 1328, Muhammad Bin Tughlaq wanted to shift his capital from Delhi to Devagiri.<\/p>\n\n\n\n<p class=\"has-text-align-justify\">Owing allegiance to the king’s preference, the place was renamed <strong>Daulatabad<\/strong>. The intention behind making it the capital seemed logical to many. Taking into consideration the regime of Muhammad Bin Tughlaq, the <strong>Daulatabad fort <\/strong>was placed right in the centre. Such a location preference would act as a guard from attracting the kingdom capital from the north-western frontier regions.<\/p>\n\n\n\n<p class=\"has-text-align-justify\">Bin Tughlaq’s decision was to shift his region from Delhi to <strong>Daulatabad.<\/strong> Thus, he orders his common population to shift their location. Later, eventually, he feels the decision to be inapt in the year 1334. Following his realization, he retreated his steps back and shifted the Delhi sultanate capital to Delhi all over again.<\/p>\n\n\n\n<h2 id=\"h-value-addition-by-the-ahmednagar-sultanate\"><strong>Value-addition by the Ahmednagar sultanate<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-justify\">In the year 1499, the <strong>Daulatabad fort <\/strong>was under the purview of the Ahmednagar sultanate, who treated it as their secondary capital. Later, in 1610, the city of Aurangabad was regarded as the Ahmednagar sultanate capital. The sultanate was presided over by Malik Ambar, who was an Ethiopian military general. He was also regarded as the prime minister of the Ahmednagar sultanate.<\/p>\n\n\n\n<p class=\"has-text-align-justify\">During the reign of the Ahmednagar sultanate, the region witnessed several value addition factors. One such example would be the construction of <strong>Chand Minar, <\/strong>which was an inspiration from the Qutub Minar of Delhi. The fortification is not a mere structure. It was crafted by people brought from Iran, especially for the purpose.<\/p>\n\n\n\n<p class=\"has-text-align-justify\">Another important aspect noticeable there is the Chini Mahal. It was specifically built by Aurangzeb to imprison Abul Hasan Tana Shah. Abul Hasan Tana Shah was the last ruler of the Qutb Shahi Dynasty, who Aurangzeb imprisoned in 1687. That&#8217;s how, after taking over the <strong>Daulatabad fort <\/strong>by the Ahmednagar sultanate, a lot more was added to the value of the place.<\/p>\n\n\n\n<h2 id=\"h-unique-features-of-the-daulatabad-fort\"><strong>Unique features of the Daulatabad fort<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-justify\">Several aspects of the fort are such that make it unique and ingenious. The structure is well known for its architecture built with a aim to make the fort defensive against the enemies. The whole shape of the fort is triangular. Besides, there are some interesting facts that make it one of the priceless possessions of the Indian subcontinent.<\/p>\n\n\n\n<ul><li>It was none other than Mohammad bin Tughlaq who renamed it as <strong>Daulatabad fort. <\/strong>Prior to that, it was mostly a fort recognized in Devagiri.&nbsp;<\/li><li>During the reign of Mohammad bin Tughlaq, he ordered his population to relocate from Delhi to <strong>Daulatabad. <\/strong>Though he later realized it to be not a fair enough idea.<\/li><li>Several key fortifications are added to the fort, which makes it even more valuable and serves as a great sight to pay a visit to.<\/li><li>The walls of the structure are massive in length and thickness. The thickness of each wall is about six to nine feet, whereas the length extends to about 18-27 feet.<\/li><li>The area known as mahakot inside the premises of the fort is a significant highlight.<\/li><li>Other walls of the fort, too, are specially equipped to hold within themselves certain arms and ammunition.<\/li><li>There is a Hathi haud built in the fort premises with a capacity to hold about 10,000 cubic meters of water.<\/li><li>The <strong>Chand Minar <\/strong>built additionally to the fort is 30 meters tall with three balconies-like structures that are circular in shape.<\/li><li>The Yadava dynasty and its rulers had made improvisations on the hill in which the fort lies. The purpose behind undertaking such actions was to build up a defence mechanism.<\/li><li>There is a narrow bridge that leads to the fort, and that is the only gateway.<\/li><li>There are several extra false additions to the fort that would act as traps for enemies.<\/li><\/ul>\n\n\n\n<h2 id=\"h-unique-architectures-of-the-fort\"><strong>Unique architectures of the fort <\/strong>&nbsp;&nbsp;<\/h2>\n\n\n\n<p class=\"has-text-align-justify\">It was built on a hill with a conical shape heightened at about 200 meters. One is most likely to find bastions and lofty gates throughout its premises. The structure of the fort is built over an area of 94.83 hectares with impeccable town planning and water management facilities. Four walls have enclosed few areas of the fort with a high mechanism to defend against the enemies.&nbsp;<\/p>\n\n\n\n<p class=\"has-text-align-justify\">To protect people in times of war or other emergencies, different structures have been built all across the fort in different locations. For example, amarkot is meant to capacitate the ordinary population of the kingdom. Mahakot, on the other hand, is meant to hold residences of the higher classes. The kalakot, on the other hand, is meant to secure residences of the royal class. The balakot is the ultimate peak where you can find the flag and pride of honour.<\/p>\n\n\n\n<p class=\"has-text-align-justify\">The fort is equipped with structures such as stepped wells, water Reservoirs, Minar, Hammam, Baradari, Andheri, Temples, Mosques, etc. Besides, there are several uneven structures of rock-cut caves that lie unfinished. Other than that, there is the Aam Khas building, Royal Hammam, Rang Mahal, Chini Mahal, and several other essential elements that a medieval fort is typically meant to accommodate within itself.<\/p>\n\n\n\n<h2 id=\"h-key-fortifications-of-the-daulatabad-fort\"><strong>Key fortifications of the Daulatabad Fort<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-justify\">There are some of the key fortifications that are an essential part of the fort even today. Here are some of those fortifications, each built with a specific purpose at hand.<\/p>\n\n\n\n<ul><li>Hathi Haud: It means an elephant tanker in the literal sense. With a length of about 47.75 m, a width of 46.75 m, and a depth of about 6.61 m, it has the capacity to hold some cubic centimetres of water at once. It was meant for the gigantic elephants of rulers from different dynasties to feed on.<\/li><li>Bharat Mata temple: with a measurement of about 87.14 m EW and 72.80 m NS direction, it holds two openings, one to the east and the other towards the northern end. Apart from the temple, there are several other religious contractions made that depict the probable ruler’s religious faith.<\/li><li>Chand Minar: It was Constructed by Sultan Ala-ud-din-Bahmanim during 1447 AD, its height is 70 m, and the circumference at the base stands at 21 m. The unique part of this structure is its three different circular balconies.<\/li><li>Andheri: in literal terms, it stands as the world of the blind. Similar was its significance in the fort. It was a meandering dark passage used as a way of defense by the then rulers to protect themselves from the enemies. The structure is something that most historical structures hold, but it is uniquely placed in the <strong>Daulatabad fort.<\/strong><\/li><li>Baradari: it was built in 1636 AD, with a capacity of 13 halls. During the Yadava dynasty reign, the Baradari was the palace of the queen. Later, during Shah Jahan’s invasion, he resided in that palace.<\/li><\/ul>\n\n\n\n<p class=\"has-text-align-justify\">Placed all across the premises of the fort, visitors and tourists often look for these sites on their tour of the fort. Such fortifications are true examples of the architectural and designing skills that people in those days possessed. They stand as inspirational structures for many construction field experts.<\/p>\n\n\n\n<h2 id=\"h-conclusion\"><strong>Conclusion<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-justify\">Tracing back to history and comparing the scenario with the present times, there is more value addition in the history. Similarly, The <strong>Daulatabad Fort <\/strong>is one such structure that dates back to some grand historical value addition. Though such sites are nothing more than tourist locations presently, they would always contribute to the rich culture and heritage that prevails in India.<\/p>\n\n\n\n<p class=\"has-text-align-justify\">Though, the valuation of the historic property has never been considered in terms of the economy. But it might stand at a sum of about some hundreds or thousands of crores of rupees. Nevertheless, the property valuation might have not been done, but in terms of adding to the Indian economy, it makes its count in the most remarkable of tourist sites spread across India.<\/p>\n\n\n\n<h2 id=\"h-you-might-also-like\">You Might Also Like<\/h2>\n\n\n\n<ul class=\"wp-block-yoast-seo-related-links\"><li><a href=\"https:\/\/www.squareyards.com\/blog\/jaipur-the-enthralling-city\">Jaipur the Enthralling City<\/a><\/li><li><a href=\"https:\/\/www.squareyards.com\/blog\/a-rich-historic-landmark-of-the-maratha-empire-raigad-fort\">A Rich Historic Landmark of the Maratha Empire: Raigad Fort<\/a><\/li><li><a href=\"https:\/\/www.squareyards.com\/blog\/the-worth-of-mysore-palace-might-surprise-you\">The worth of Mysore Palace might surprise you!<\/a><\/li><li><a href=\"https:\/\/www.squareyards.com\/blog\/popular-places-to-visit-in-pune\">Popular places to visit in Pune<\/a><\/li><li><a href=\"https:\/\/www.squareyards.com\/blog\/indian-realty-sector-to-witness-addition-of-200-million-sq-ft-this-year\">Indian realty sector to witness addition of 200 million sq. ft. this year<\/a><\/li><\/ul>\n\n\n\n<h2 id=\"h-frequently-asked-questions-faqs\">Frequently Asked Questions (FAQs)<\/h2>\n\n\n        <section class=\"sc_fs_faq sc_card\">\n            <div>\n\t\t\t\t<h2>When was the chand minar constructed as part of the Daulatabad fort? <\/h2>                <div>\n\t\t\t\t\t                    <p>\n\t\t\t\t\t\tIt was established during the 1445 C.E by King Ala-ud-din Bahmani. The purpose of such construction was to honour his capture of the fort. It was not a part of the fort ever since its existence and establishment. Later, when it was added, it acted as a value addition to its existing value.                    <\/p>\n                <\/div>\n            <\/div>\n        <\/section>\n\t        <section class=\"sc_fs_faq sc_card\">\n            <div>\n\t\t\t\t<h2>Daulatabad fort distance from Aurangabad?<\/h2>                <div>\n\t\t\t\t\t                    <p>\n\t\t\t\t\t\tLocated on MH SH 22 in Daulatabad, it takes about 36 minutes to reach the fort from Aurangabad. The distance to be covered is nearly about 18.4 km. On reaching the fort, there are several other historically structured destinations nearby where one can visit.                    <\/p>\n                <\/div>\n            <\/div>\n        <\/section>\n\t        <section class=\"sc_fs_faq sc_card\">\n            <div>\n\t\t\t\t<h2>Where is Daulat Abad situated?<\/h2>                <div>\n\t\t\t\t\t                    <p>\n\t\t\t\t\t\tDaulatabad, also initially named Devagiri or Deogiri, is a village and an ancient city. It is located in the north-central zone of the state of Maharashtra, which is in western India. Precisely, the fort is situated in a hilly conical upland region, at a distance of about 8 miles, i.e., 13 km towards the northwest of Aurangabad.                    <\/p>\n                <\/div>\n            <\/div>\n        <\/section>\n\t        <section class=\"sc_fs_faq sc_card\">\n            <div>\n\t\t\t\t<h2>How many cannons are there in Daulatabad Fort?<\/h2>                <div>\n\t\t\t\t\t                    <p>\n\t\t\t\t\t\tAs per the Directorate of Archaeology &#038; Museums under the Government of Maharashtra, there are about 288 canons overall. Despite changing multiple hands of rulers and being capitals of their kingdom, its canon deports remain unchanged since time immemorial.                    <\/p>\n                <\/div>\n            <\/div>\n        <\/section>\n\t        <section class=\"sc_fs_faq sc_card\">\n            <div>\n\t\t\t\t<h2>How many hands did the Daulatabad Fort change?<\/h2>                <div>\n\t\t\t\t\t                    <p>\n\t\t\t\t\t\tThe fort was initially the capital of the Yadava kingdom between the 9th and the 14th century CE. Additionally, it was the capital of the Delhi Sultanate during Tughlaq’s reign between 1327 and 1334. Finally, it was the secondary capital to the Ahmednagar Sultanate in the periods 1499 and 1636.                    <\/p>\n                <\/div>\n            <\/div>\n        <\/section>\n\t\n<script type=\"application\/ld+json\">\n    {\n        \"@context\": \"https:\/\/schema.org\",\n        \"@type\": \"FAQPage\",\n        \"mainEntity\": [\n                    {\n                \"@type\": \"Question\",\n                \"name\": \"When was the chand minar constructed as part of the Daulatabad fort? \",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"It was established during the 1445 C.E by King Ala-ud-din Bahmani. The purpose of such construction was to honour his capture of the fort. It was not a part of the fort ever since its existence and establishment. Later, when it was added, it acted as a value addition to its existing value.\"\n                                    }\n            }\n            ,\t            {\n                \"@type\": \"Question\",\n                \"name\": \"Daulatabad fort distance from Aurangabad?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"Located on MH SH 22 in Daulatabad, it takes about 36 minutes to reach the fort from Aurangabad. The distance to be covered is nearly about 18.4 km. On reaching the fort, there are several other historically structured destinations nearby where one can visit.\"\n                                    }\n            }\n            ,\t            {\n                \"@type\": \"Question\",\n                \"name\": \"Where is Daulat Abad situated?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"Daulatabad, also initially named Devagiri or Deogiri, is a village and an ancient city. It is located in the north-central zone of the state of Maharashtra, which is in western India. Precisely, the fort is situated in a hilly conical upland region, at a distance of about 8 miles, i.e., 13 km towards the northwest of Aurangabad.\"\n                                    }\n            }\n            ,\t            {\n                \"@type\": \"Question\",\n                \"name\": \"How many cannons are there in Daulatabad Fort?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"As per the Directorate of Archaeology &amp; Museums under the Government of Maharashtra, there are about 288 canons overall. Despite changing multiple hands of rulers and being capitals of their kingdom, its canon deports remain unchanged since time immemorial.\"\n                                    }\n            }\n            ,\t            {\n                \"@type\": \"Question\",\n                \"name\": \"How many hands did the Daulatabad Fort change?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"The fort was initially the capital of the Yadava kingdom between the 9th and the 14th century CE. Additionally, it was the capital of the Delhi Sultanate during Tughlaq’s reign between 1327 and 1334. Finally, it was the secondary capital to the Ahmednagar Sultanate in the periods 1499 and 1636.\"\n                                    }\n            }\n            \t        ]\n    }\n\n<\/script>","protected":false},"excerpt":{"rendered":"<p>India, with its rich heritage and culture, is home to some of the majestic historical structures. Such structures have been part of the Indian subcontinent for centuries now. &nbsp;It is not just the valuation of the historical structures that are assets for the nation. Their mere existence is a value addition. One of such structures, [&hellip;]<\/p>\n","protected":false},"author":21,"featured_media":31353,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_editorskit_title_hidden":false,"_editorskit_reading_time":6,"_editorskit_typography_data":[],"_editorskit_blocks_typography":""},"categories":[215],"_links":{"self":[{"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/posts\/31352"}],"collection":[{"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/comments?post=31352"}],"version-history":[{"count":2,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/posts\/31352\/revisions"}],"predecessor-version":[{"id":31356,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/posts\/31352\/revisions\/31356"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/media\/31353"}],"wp:attachment":[{"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/media?parent=31352"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/categories?post=31352"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}