{"id":31369,"date":"2021-07-17T11:43:25","date_gmt":"2021-07-17T06:13:25","guid":{"rendered":"https:\/\/www.squareyards.com\/blog\/?p=31369"},"modified":"2021-07-17T11:44:23","modified_gmt":"2021-07-17T06:14:23","slug":"vastu-tips-tricks-for-north-facing-home","status":"publish","type":"post","link":"https:\/\/www.squareyards.com\/blog\/vastu-tips-tricks-for-north-facing-home","title":{"rendered":"Vastu Tips &#038; Tricks For North-Facing Home"},"content":{"rendered":"\n<p class=\"has-text-align-justify\">The very concept of Vastu Shastra came forward during the Vedic times in India, that is the science of space and architecture that guides the people to create spaces and environment that supports their physical, mental and spiritual health and paves the way for a prosperous life. Vastu Shastra is regarded as the science of designing and building houses, offices, temples, and other living spaces. Since ancient times, energy has been considered a free-flowing creation that can neither be created nor destroyed.<\/p>\n\n\n\n<p class=\"has-text-align-justify\">&nbsp;The transformation from one form to the other is possible. This free-flowing energy directs all the positive or negative vibes and thoughts within ourselves and our surroundings. Following the sets of rules and regulations of Vastu before entering any new place is mandatory to live a healthy and peaceful life.<\/p>\n\n\n\n<p class=\"has-text-align-justify\">Referring to our auspicious Mythology and Vedas, Vastu Shastra indicates the directions- East and North to be most blessed with positive energies; hence, North-facing homes are the most auspicious ones.<strong> Vastu Shastra for North Facing Homes <\/strong>is widely accepted because of the presence of Lord Kuber, also known as the God of Wealth, in the North direction. It is not only the north-facing home that brings in prosperity but the whole North-facing house planin which every direction should be planned as per the Vastu. North Facing Home Vastu includes a complete list of directions for different corners of the house that needs to be followed to attract good positive energies. The list is as follows:<\/p>\n\n\n\n<ul><li><strong>Master Bedroom:<\/strong> Should face South-west region<\/li><li><strong>Pooja Room:<\/strong> Should be located in North-east region<\/li><li><strong>Living Room:<\/strong> Should face North-east region<\/li><li><strong>Guest Room:<\/strong> Should be in the North-west region<\/li><li><strong>Kitchen:<\/strong> Should lie in the South-east or North-west direction.<\/li><\/ul>\n\n\n\n<h2 id=\"h-about-north-facing-home\"><strong>About North Facing Home<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-justify\">Briefly describing since the existence of humans, directions have played an essential role in assisting where, what and when to hunt, hide and migrate. Era&#8217;s changed, but directions still play a significant role in defining wealth and prosperity in human life; hence, the main entry gate of any house situated in the north direction is considered as North Facing Home that accounts for most positive energies.<\/p>\n\n\n\n<h2 id=\"h-are-north-facing-homes-good-or-bad\"><strong>Are North Facing Homes Good or Bad?<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-justify\">It would not be fitting to conclude that only <strong>North Facing House Plans<\/strong> are the most appropriate and good ones, and the rest of the directions are not; rather, all the directions have their specialty, no direction is good or bad. People need to follow specific guidelines of <strong>Vastu Shastra for North Facing Homes <\/strong>to attract prosperity to their homes.<\/p>\n\n\n\n<h2 id=\"h-location-of-main-gate-in-north-facing-house-plan\"><strong>Location of Main Gate in North Facing House Plan<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-justify\">In any house plan, there is always a special emphasis on the location of the main gate because it is the entrance point of the home from where either all negative or all the positive forces will enter the home. Hence its placement is the major area of concern. So, in a<strong> North Facing House Plan<\/strong>, the main gate should only be located in the North direction, the distance between north-east and north-west is divided into nine equal parts, where also the fifth step is the most auspicious among all because of the belief of the existence of God of Wealth there.<\/p>\n\n\n\n<figure class=\"wp-block-table\"><table><tbody><tr><td class=\"has-text-align-center\" data-align=\"center\"><span style=\"background-color:#0693e3\" class=\"has-inline-background\">9<\/span><\/td><td class=\"has-text-align-center\" data-align=\"center\"><span style=\"background-color:#0693e3\" class=\"has-inline-background\">8<\/span><\/td><td class=\"has-text-align-center\" data-align=\"center\"><span style=\"background-color:#0693e3\" class=\"has-inline-background\">7<\/span><\/td><td class=\"has-text-align-center\" data-align=\"center\"><span style=\"background-color:#0693e3\" class=\"has-inline-background\">6<\/span><\/td><td class=\"has-text-align-center\" data-align=\"center\"><span style=\"background-color:#0bf90d\" class=\"has-inline-background\">5<\/span><\/td><td class=\"has-text-align-center\" data-align=\"center\"><span style=\"background-color:#fef208\" class=\"has-inline-background\">4<\/span><\/td><td class=\"has-text-align-center\" data-align=\"center\"><span style=\"background-color:#fef208\" class=\"has-inline-background\">3<\/span><\/td><td class=\"has-text-align-center\" data-align=\"center\"><span style=\"background-color:#fef208\" class=\"has-inline-background\">2<\/span><\/td><td class=\"has-text-align-center\" data-align=\"center\"><span style=\"background-color:#fef208\" class=\"has-inline-background\">1<\/span><\/td><\/tr><\/tbody><\/table><figcaption>↑ Towards North<\/figcaption><\/figure>\n\n\n\n<h2 id=\"h-importance-of-padas-in-vastu-shastra\"><strong>Importance of Padas in Vastu Shastra<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-justify\">According to the Vastu Shastra, a north-facing home is the most auspicious location as no pada situated in this direction is considered inauspicious. But to attract prosperity and well-being of the family members, people should follow the following tips:<\/p>\n\n\n\n<p class=\"has-text-align-justify\">As stated above, the fifth pada is considered the most auspicious among all the nine padas because of the presence of the Lord of wealth Kuber and determines the entrance of all the flow of energy in the house. Therefore, the main gate should always be placed in the fifth pada to attract wealth and prosperity to your home.<\/p>\n\n\n\n<h2 id=\"h-is-there-any-alternative-for-placing-the-main-door-at-the-fifth-pada\"><strong>Is there any alternative for placing the main door at the fifth pada?<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-justify\">In Vastu Shastra, it is advised that if due to any circumstances like size issue or anything else, the individual cannot place the main gate at fifth pada, then they may utilize first to the fourth pada particularly, and should not leave the fifth one. In some cases, if there is no choice to place the main door from first to the fifth pada, people may use sixth to the ninth pada to place the door.<\/p>\n\n\n\n<p class=\"has-text-align-justify\"><strong>Caution: <\/strong>It is advised that, due to the unavailability of any other pada for placement of the door, any individual tends to place the door at the fifth pada, they are advised to leave some space from the north-east corner. The door must not touch this corner under any circumstances.<strong><\/strong><\/p>\n\n\n\n<h2 id=\"h-ideal-north-facing-house-plan\"><strong>Ideal North Facing House Plan<\/strong><\/h2>\n\n\n\n<h3 id=\"h-west-direction\"><strong>West Direction<\/strong><\/h3>\n\n\n\n<p><u><strong>Ideal for:<\/strong><\/u><\/p>\n\n\n\n<ul><li>Kids Bedroom<\/li><li>Dining Room<\/li><li>Study Room<\/li><li>Stairs<\/li><\/ul>\n\n\n\n<h3 id=\"h-north-west-direction\"><strong>North-West Direction<\/strong><\/h3>\n\n\n\n<p><strong><u>Ideal for:<\/u><\/strong><\/p>\n\n\n\n<ul><li>Guest Bedroom<\/li><li>Kitchen<\/li><li>Living Room<\/li><\/ul>\n\n\n\n<h3 id=\"h-north-direction\"><strong>North Direction<\/strong><\/h3>\n\n\n\n<p><strong><u>Ideal for:<\/u><\/strong><\/p>\n\n\n\n<ul><li>Drawing Room<\/li><li>Living Room<\/li><li>Office<\/li><\/ul>\n\n\n\n<h3 id=\"h-north-east-direction\"><strong>North-East Direction<\/strong><\/h3>\n\n\n\n<p><strong><u>Ideal for:<\/u><\/strong><\/p>\n\n\n\n<ul><li>Puja Room<\/li><\/ul>\n\n\n\n<p><strong><u>Not Good for:<\/u><\/strong><\/p>\n\n\n\n<ul><li>Guardroom, storeroom, servant’s room, generator, kitchen, bathroom, and stairs.<\/li><\/ul>\n\n\n\n<h3 id=\"h-east-direction\"><strong>East Direction<\/strong><\/h3>\n\n\n\n<p><strong><u>Ideal for:<\/u><\/strong><\/p>\n\n\n\n<ul><li>Hall<\/li><li>Balcony<\/li><li>Porch<\/li><li>Verandah<\/li><\/ul>\n\n\n\n<h3 id=\"h-south-east-direction\"><strong>South-East Direction<\/strong><\/h3>\n\n\n\n<p><strong><u>Ideal for:<\/u><\/strong><\/p>\n\n\n\n<ul><li>Bathroom<\/li><li>Kitchen<\/li><li>Stairs<\/li><\/ul>\n\n\n\n<h3 id=\"h-south-direction\"><strong>South Direction<\/strong><\/h3>\n\n\n\n<p><strong><u>Ideal for:<\/u><\/strong><\/p>\n\n\n\n<ul><li>Stairs<\/li><li>Overhead Tank<\/li><\/ul>\n\n\n\n<h3 id=\"h-south-west-direction\"><strong>South-West Direction<\/strong><\/h3>\n\n\n\n<p><strong><u>Ideal for:<\/u><\/strong><\/p>\n\n\n\n<ul><li>Master Bedroom<\/li><li>Garage<\/li><li>Dresser<\/li><li>Walk-in closet<\/li><li>Stairs<\/li><li>Bathroom<\/li><li>Store<\/li><\/ul>\n\n\n\n<h2 id=\"h-placement-tips-for-north-facing-home-vastu\"><strong>Placement Tips for North Facing Home Vastu<\/strong><\/h2>\n\n\n\n<h3 id=\"h-slope-in-a-north-facing-home\"><strong>Slope in a North Facing Home<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-justify\">Since our ancient legends North direction has been considered highly auspicious as it attracts health and prosperity, therefore, it is advised that no north-facing house should have a slope existing in the North to south direction.<\/p>\n\n\n\n<h3 id=\"h-kitchen\"><strong>Kitchen<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-justify\">In a <strong>North-facing house plan, <\/strong>it is advised that the Kitchen should be located either in the southeast or northwest corners. However, the kitchen should never be placed in the northeast corner.<\/p>\n\n\n\n<h3 id=\"h-no-trash-accumulation\"><strong>No trash accumulation<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-justify\">According to the Vastu, it is advised that any garbage should not be accumulated in the North or northeast corner of the house, as they are the most auspicious corner of the house.<\/p>\n\n\n\n<h3 id=\"h-trees-in-a-north-facing-home\"><strong>Trees in a north-facing home<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-justify\">It is advised that no trees should be located on the north side of the home as it may become a barrier in attracting good energy to the house.<\/p>\n\n\n\n<h3 id=\"h-placement-of-holy-items\"><strong>Placement of Holy items<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-justify\">Holy items in every household are very auspicious, and their placement cannot be compromised. These items include religious symbols such as Swastika, Om, statues, paintings, etc., that cannot be kept anywhere and should be placed appropriately.<\/p>\n\n\n\n<h3 id=\"h-electricity-circuit-board\"><strong>Electricity circuit board<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-justify\">The electricity board should be placed in the southeast corner of the house because it is responsible for supplying electricity to the entire house. Placing the board in the southeast zone balances the distribution of energy.<\/p>\n\n\n\n<h3 id=\"h-the-direction-of-septic-tanks\"><strong>The direction of septic tanks<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-justify\">One should never place the septic tank around or in the northeast direction.<\/p>\n\n\n\n<h3 id=\"h-placement-of-bedrooms-and-toilets\"><strong>Placement of Bedrooms and Toilets<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-justify\">According to the Vastu of the bedroom, it is advised to construct them in the southwest region. Bathrooms and toilets should never be placed in the corners facing northeast.<\/p>\n\n\n\n<h3 id=\"h-pooja-room\"><strong>Pooja room<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-justify\">The pooja room and living room should be placed in the northeast direction.<\/p>\n\n\n\n<h3 id=\"h-guest-room\"><strong>Guest room<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-justify\">A guest room should be in the northwest direction.<\/p>\n\n\n\n<h3 id=\"h-garage-car-parking\"><strong>Garage\/car parking<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-justify\">Garage or the parking space should be planned either in the southeast or northwest direction but should be avoided in the north direction as it may cause trouble with the family’s mental peace.<\/p>\n\n\n\n<h3 id=\"h-level-of-land-in-a-north-facing-home\"><strong>Level of land in a north-facing home<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-justify\">The main area of concern of the level of the land is the north direction, i.e., the land should not be higher in the north direction, nor the north direction side of the house should be placed higher than the rest of the house. The level of the floors of the entire house should be on the same lower level. It is also believed that if the front portion of the house is on a lower level, then the central room will bring progress.<\/p>\n\n\n\n<h2 id=\"h-how-to-ensure-luck-in-the-north-facing-home\"><strong>How to ensure luck in the north-facing home?<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-justify\">According to the Vastu Shastra, it is claimed that a north-facing house is the best, and if it is extended to the northeast side, it may bring greater luck. Apartments located in the north direction are not a good idea, but the flow of energy can be regulated by placing an idol of Lord Kuber towards the north direction. Vastu also claims that placing a Tulsi plant in the North, Northeast, or East direction of the house converts any negative energy into positive and brings health and prosperity.<\/p>\n\n\n\n<h2 id=\"h-staircase-placement-in-north-facing-property\"><strong>Staircase placement in north-facing property<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-justify\">For the placement of any item or room in a house, a Vastu expert should always be contacted to make the house situated in the aura of positive vibes.<\/p>\n\n\n\n<p class=\"has-text-align-justify\">Here are some quick guidelines to ensure effective placements in a house:<\/p>\n\n\n\n<ul><li>Staircases should not be placed in the north direction to avoid any financial loss.<\/li><li>For the staircase, south, west, southeast, southwest, and northwest directions are considered ideal.<\/li><li>To avoid any nerve-related health issues, one should avoid placing staircases in the northeast direction.<\/li><li>Staircases should be placed in a clockwise fashion.<\/li><\/ul>\n\n\n\n<h2 id=\"h-effects-on-women-in-a-north-facing-house-plan\"><strong>Effects on Women in a North Facing House Plan<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-justify\">Vastu Shastra states that wealth, health, and especially women are affected by the position of the house in a certain direction. Even a woman&#8217;s success is also linked to the house she is living in, so people should be aware of the tips by which they can correct all the Vastu-doshas.<\/p>\n\n\n\n<ul><li>Vastu states that the southeast corner is the home of the planet Venus, which is related to women, so the southeast corner of the house should follow the Vastu related terms; else, the working women or women in the house may face problems and struggles in life.<\/li><li>There should be a provision of a well-lit area in the house if the main door or the bedroom door has entrances from the southeast corner.<\/li><li>Placement of an open and wide water tank or source of water in the north face is considered helpful for the growth of women.<\/li><li>Any damage in the southeast, northwest, or west zone of the house may cause severe health issues or an unsuccessful career for the women.<\/li><\/ul>\n\n\n\n<h2 id=\"h-which-people-should-prefer-a-north-facing-home\"><strong>Which people should prefer a North Facing Home?<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-justify\">People with their zodiac or rashi as Cancer, Scorpio, or Pisces find north-facing homes best suitable for them. Even for the people into professions like businesses or finance, such as chartered accountants, accountants, bankers, stock market traders, and investors. The broker finds that north-facing homes are beneficial in their growth. North-facing homes are also best for communication and e-service providers, tour and travel services, astrology and Vastu services, or those in the hospitality sector.<\/p>\n\n\n\n<h2 id=\"h-north-facing-homes-good-for-senior-citizens\"><strong>North-facing homes good for Senior Citizens?<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-justify\">Ideally, according to the Vastu Shastra, it is advised that the head of the family should reside in the southwest or south-facing room. If the head of the family is now retired and involved in spiritual or religious work, he must reside in the room facing North, northeast, and the east to attract prosperity and health.<\/p>\n\n\n\n<h2 id=\"h-things-to-avoid-in-a-north-facing-house-plan\"><strong>Things to avoid in a North Facing House plan<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-justify\">Following are the points that an individual must avoid in their north-facing home:<\/p>\n\n\n\n<ul><li>Never have the main entrance of the house placed in the northwest direction.<\/li><li>No bedrooms, toilets, or kitchens should be placed in the northeast corner of the house.<\/li><li>The wastewater runoff should not be located in the north or south direction.<\/li><li>Never place the entrance door on the sixth pada.<\/li><li>Never go for a north-facing property without looking for any other things that may or may not work in your favour.<\/li><li>Gardening should not be done in the northwest direction.<\/li><li>The underground tank should be placed in the northwest direction of the house.<\/li><li>Never paint your house in red or shades of maroon.<\/li><li>Septic tanks should not be located in the North, Northeast, or East direction of the house.<\/li><\/ul>\n\n\n\n<h2 id=\"h-conclusion\"><strong>Conclusion<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-justify\">Since our great mythologies, i.e., Mahabharata and Ramayana that are believed to have existed almost 3000-5000 years ago, the existence and belief in Vastu Shastra also came into power, which cannot be neglected at any cost. When things are placed according to the Vastu, good vibes, energy, and health are attracted, and if not, then many unimaginable, bad things do happen. So, one must always consult Vastu before buying any property and after shifting to a new property. According to Vastu Shastra, no direction is good or bad. Still, a north-facing property is considered most auspicious due to the belief of Lord Kuber. For any doshas, in the rest of the directions, many Vastu doshas tips are also there that help to attract positive energies in non-north-facing properties too.<\/p>\n\n\n\n<h2 id=\"h-you-might-also-like\">You Might Also Like<\/h2>\n\n\n\n<ul class=\"wp-block-yoast-seo-related-links\"><li><a href=\"https:\/\/www.squareyards.com\/blog\/north-facing-house-vastu-plan\">North Facing House Vastu Plan for a Peaceful Life<\/a><\/li><li><a href=\"https:\/\/www.squareyards.com\/blog\/real-advice-from-a-real-woman-entrepreneur-for-women-to-start-investing\">Real Advice from a Real Woman Entrepreneur for Women to Start Investing<\/a><\/li><li><a href=\"https:\/\/www.squareyards.com\/blog\/south-facing-house-vastu-plans\">How to Improve Vastu for a South-facing Home?<\/a><\/li><li><a href=\"https:\/\/www.squareyards.com\/blog\/west-facing-house-vastu-plan-tips\">West Facing House Vastu Plan &amp; Tips<\/a><\/li><li><a href=\"https:\/\/www.squareyards.com\/blog\/vastu-for-flats\">Vastu for Flats &amp; Apartments: 15 Major signs to watch out for<\/a><\/li><\/ul>\n\n\n\n<h2 id=\"h-frequently-asked-questions-faqs\">Frequently Asked Questions (FAQs)<\/h2>\n\n\n        <section class=\"sc_fs_faq sc_card\">\n            <div>\n\t\t\t\t<h2>In which colors can we paint our north-facing home?<\/h2>                <div>\n\t\t\t\t\t                    <p>\n\t\t\t\t\t\tNorth-facing homes can be painted in shades of blue, white, cream, or khaki.                    <\/p>\n                <\/div>\n            <\/div>\n        <\/section>\n\t        <section class=\"sc_fs_faq sc_card\">\n            <div>\n\t\t\t\t<h2>Which corner is best for the placement of the Puja room?<\/h2>                <div>\n\t\t\t\t\t                    <p>\n\t\t\t\t\t\tThe northeast corner is ideal for the placement of the Puja room in the house.                    <\/p>\n                <\/div>\n            <\/div>\n        <\/section>\n\t        <section class=\"sc_fs_faq sc_card\">\n            <div>\n\t\t\t\t<h2>For the placement of things, which southwest direction is ideal?<\/h2>                <div>\n\t\t\t\t\t                    <p>\n\t\t\t\t\t\tSouthwest direction is ideal for dressers, stores, or the placement of staircase.                    <\/p>\n                <\/div>\n            <\/div>\n        <\/section>\n\t        <section class=\"sc_fs_faq sc_card\">\n            <div>\n\t\t\t\t<h2>Why are north-facing properties so popular?<\/h2>                <div>\n\t\t\t\t\t                    <p>\n\t\t\t\t\t\tNorth facing is so popular because, according to our Vastu Shastra, it is believed that the god of wealth, Lord Kuber resides in the north direction, which brings wealth and prosperity to our lives.                    <\/p>\n                <\/div>\n            <\/div>\n        <\/section>\n\t        <section class=\"sc_fs_faq sc_card\">\n            <div>\n\t\t\t\t<h2>Can mirrors be placed in the south or southeast face of the property?<\/h2>                <div>\n\t\t\t\t\t                    <p>\n\t\t\t\t\t\tNo, mirrors cannot be placed in the south or southeast face of the property.                    <\/p>\n                <\/div>\n            <\/div>\n        <\/section>\n\t\n<script type=\"application\/ld+json\">\n    {\n        \"@context\": \"https:\/\/schema.org\",\n        \"@type\": \"FAQPage\",\n        \"mainEntity\": [\n                    {\n                \"@type\": \"Question\",\n                \"name\": \"In which colors can we paint our north-facing home?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"North-facing homes can be painted in shades of blue, white, cream, or khaki.\"\n                                    }\n            }\n            ,\t            {\n                \"@type\": \"Question\",\n                \"name\": \"Which corner is best for the placement of the Puja room?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"The northeast corner is ideal for the placement of the Puja room in the house.\"\n                                    }\n            }\n            ,\t            {\n                \"@type\": \"Question\",\n                \"name\": \"For the placement of things, which southwest direction is ideal?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"Southwest direction is ideal for dressers, stores, or the placement of staircase.\"\n                                    }\n            }\n            ,\t            {\n                \"@type\": \"Question\",\n                \"name\": \"Why are north-facing properties so popular?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"North facing is so popular because, according to our Vastu Shastra, it is believed that the god of wealth, Lord Kuber resides in the north direction, which brings wealth and prosperity to our lives.\"\n                                    }\n            }\n            ,\t            {\n                \"@type\": \"Question\",\n                \"name\": \"Can mirrors be placed in the south or southeast face of the property?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"No, mirrors cannot be placed in the south or southeast face of the property.\"\n                                    }\n            }\n            \t        ]\n    }\n\n<\/script>","protected":false},"excerpt":{"rendered":"<p>The very concept of Vastu Shastra came forward during the Vedic times in India, that is the science of space and architecture that guides the people to create spaces and environment that supports their physical, mental and spiritual health and paves the way for a prosperous life. Vastu Shastra is regarded as the science of [&hellip;]<\/p>\n","protected":false},"author":21,"featured_media":31376,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_editorskit_title_hidden":false,"_editorskit_reading_time":8,"_editorskit_typography_data":[],"_editorskit_blocks_typography":""},"categories":[8514,4575],"_links":{"self":[{"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/posts\/31369"}],"collection":[{"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/comments?post=31369"}],"version-history":[{"count":7,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/posts\/31369\/revisions"}],"predecessor-version":[{"id":31377,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/posts\/31369\/revisions\/31377"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/media\/31376"}],"wp:attachment":[{"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/media?parent=31369"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/categories?post=31369"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}