{"id":31362,"date":"2021-07-16T11:31:35","date_gmt":"2021-07-16T06:01:35","guid":{"rendered":"https:\/\/www.squareyards.com\/blog\/?p=31362"},"modified":"2021-07-16T11:31:38","modified_gmt":"2021-07-16T06:01:38","slug":"this-is-the-best-time-for-end-users-to-buy-their-homes","status":"publish","type":"post","link":"https:\/\/www.squareyards.com\/blog\/this-is-the-best-time-for-end-users-to-buy-their-homes","title":{"rendered":"This is the best time for end-users to buy their homes"},"content":{"rendered":"<p style=\"text-align: justify\"><span style=\"font-weight: 400\">Residential real estate sales figures were steady between January and March, 2021 although they fell in the quarter between April and June, with the second wave of the coronavirus pandemic leading to countrywide lockdowns. Demand has improved a little since the month of June and for those seeking to purchase a home for end-use, experts feel that this is the best possible time.&nbsp;<\/span><\/p>\n<p style=\"text-align: justify\"><span style=\"font-weight: 400\">Demand is steadily coming back to the market. In some business sectors like IT, employees have garnered decent bonuses and salary hikes even for FY2020-21 and with projected 8.5-10% of economic growth in 2021-22, purchasing power may be enhanced more. The current hybrid working model may continue, prompting many buyers to switch from rented apartments in prime locations near their offices to their own homes on the periphery of major cities. Some are also upgrading to bigger housing units with ample space for setting up a home office. Some property platforms have confirmed that 35-40% of buyers are seeking to upgrade their homes. Real estate prices have mostly remained static or corrected in major markets with some markets witnessing only slim 2-3% gains annually for more than 8 years. The chances of prices falling downwards after a prolonged downward spiral are very less as per industry experts.&nbsp;<\/span><\/p>\n<p style=\"text-align: justify\"><span style=\"font-weight: 400\">Several developers have already revised pricing since commodity costs have gone up for them, spurring higher input expenditure. New projects will automatically account for these extra costs and be priced at higher rates. Multi-year lows in ready to move inventory in cities like Mumbai and Delhi indicates clear buyer preference in this category. Principal Partner &amp; Director Sales at Square Yards, <strong>Kapil Malhotra<\/strong>, feels that prices may inch upwards if recovery happens smoothly. Home loan interest rates are already at their lowest thresholds. After Maharashtra’s example, even West Bengal has reduced stamp duty and circle rates. The Delhi Government has also lowered circle rates till 30<\/span><span style=\"font-weight: 400\">th<\/span><span style=\"font-weight: 400\"> September, 2021. These new developments may reduce buyer costs even further.&nbsp;<\/span><\/p>\n<p style=\"text-align: justify\"><span style=\"font-weight: 400\">Malhotra opines that Grade A developers may not always offer discounts on properties although buyers may still be able to negotiate 8-10% discounts from Grade B and Grade C developers although these may withdraw with a pick-up in demand. Some realty players are still providing 9:91 or 20:80 payment plans although the quantum of offers is much lower. Many peripheral zones are also benefiting from the advent of metro railway connectivity and several new areas are emerging as favored destinations in cities like Hyderabad and Bengaluru where rates are still attractive.&nbsp;<\/span><\/p>\n<p style=\"text-align: justify\"><span style=\"font-weight: 400\">Experts feel that buying for end-use is only advisable if there is low income risk and the buyer is certain that he\/she will reside in a particular area with family for a minimum of 10 years. If not, then the purchase should now be deferred and savings invested in other channels as per experts. Expenditure of 8-10% of the price will be incurred in a single round of sale and purchase. Hence, living for 10 years will at least justify this expenditure. There are risks of a third wave of the coronavirus and single income households may be under pressure to arrange around 20% of the cost as down payment while having a minimum corpus of 24 months of home loan EMIs and arrange a hedge against any job losses and financial risks. 24 months will suffice for double income households where spouses may take care of expenses. <\/span><\/p>\n<p><strong>For a detailed report on this read the articles we were featured in:<\/strong><\/p>\n<p>Business Standard : https:\/\/bit.ly\/36zO3JZ<\/p>\n<p><strong>Published Date: July 14, 2021<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Residential real estate sales figures were steady between January and March, 2021 although they fell in the quarter between April and June, with the second wave of the coronavirus pandemic leading to countrywide lockdowns. Demand has improved a little since the month of June and for those seeking to purchase a home for end-use, experts [&hellip;]<\/p>\n","protected":false},"author":11,"featured_media":31364,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_editorskit_title_hidden":false,"_editorskit_reading_time":2,"_editorskit_typography_data":[],"_editorskit_blocks_typography":""},"categories":[234],"_links":{"self":[{"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/posts\/31362"}],"collection":[{"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/users\/11"}],"replies":[{"embeddable":true,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/comments?post=31362"}],"version-history":[{"count":2,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/posts\/31362\/revisions"}],"predecessor-version":[{"id":31365,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/posts\/31362\/revisions\/31365"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/media\/31364"}],"wp:attachment":[{"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/media?parent=31362"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/categories?post=31362"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}