{"id":31389,"date":"2021-07-17T12:58:24","date_gmt":"2021-07-17T07:28:24","guid":{"rendered":"https:\/\/www.squareyards.com\/blog\/?p=31389"},"modified":"2021-07-17T18:13:17","modified_gmt":"2021-07-17T12:43:17","slug":"get-familiar-with-these-real-estate-terms-carpet-area-built-up-area-and-super-built-up-area","status":"publish","type":"post","link":"https:\/\/www.squareyards.com\/blog\/get-familiar-with-these-real-estate-terms-carpet-area-built-up-area-and-super-built-up-area","title":{"rendered":"Get Familiar With These Real-Estate Terms: Carpet Area, Built-Up Area and Super Built-Up Area"},"content":{"rendered":"\n<p class=\"has-text-align-justify\">Understanding the technical jargon used by real estate brokers is critical for potential homebuyers to prevent mistakes that might jeopardize their chances of acquiring the house of their dreams. In India, developers and agents frequently use the words carpet area, built-up area, and super built-up area, prompting many people to search for explanations on the internet. In reality, some fraudulent companies have taken advantage of customers&#8217; lack of information by demanding greater costs. As a result, it is critical that you complete your study before speaking with your agent again.<\/p>\n\n\n\n<p class=\"has-text-align-justify\">Square Yards explains the distinctions between the carpet area, built-up area, and super built-up area, three widely used terminologies:<\/p>\n\n\n\n<h2 id=\"h-carpet-area\">Carpet Area<\/h2>\n\n\n\n<p class=\"has-text-align-justify\">A carpet area is an area that may be covered by a carpet, as the name suggests. The actual usable floor space of a house is determined by the distance between walls. Builders are required by RERA (Real Estate Regulation and Development Act) rules to reveal the carpet area of each unit upon which the selling price must be determined. This space does not include the area occupied by the exterior walls, balcony, or terrace, unlike the built-up area described below. The carpet area, which becomes your personal space, however, comprises the thickness of the house&#8217;s interior walls.<\/p>\n\n\n\n<p class=\"has-text-align-justify\">The carpet area covers roughly 70% of the built-up area, which includes the living area, bedrooms, and other rooms, the kitchen and baths, and, on some occasions, even the interior stairway. Assuming you have a built-up space of 1,000 square feet, the carpet area will be 70% of 1,000 square feet or 700 square feet.<\/p>\n\n\n\n<h2 id=\"h-calculate-the-carpet-area-using-this-formula\">Calculate the carpet area using this formula<\/h2>\n\n\n\n<p>Carpet area = bedroom + living area + balconies + toilets – inner wall thickness<\/p>\n\n\n\n<h2 id=\"h-how-can-you-make-sure-you-do-not-get-misled-when-it-comes-to-the-carpet-area\">How can you make sure you do not get misled when it comes to the carpet area?<\/h2>\n\n\n\n<p class=\"has-text-align-justify\">If you are purchasing a project in a large housing society, the developer is required by the RERA to disclose the carpet area of the unit. However, you need to hire a technical expert to come to the apartment and measure the space. If you apply for a mortgage, the bank will send a technical expert to inspect the property. Check with them to see whether the carpet area that the developer told you about is the same as what they estimated. If there are any inconsistencies, you should notify the developer and renegotiate the price.<\/p>\n\n\n\n<p class=\"has-text-align-justify\">Another important point to keep in mind when buying a home is not to be carried away by the built-up or super-built-up area figures if the carpet area is not as per your preference. At the end of the day, the carpet area is the area that you will use in your everyday life. Ascertain that the three figures are perfectly balanced, with the carpet area taking the lead.<\/p>\n\n\n\n<h2 id=\"h-a-few-other-things-to-keep-in-mind\">A few other things to keep in mind<\/h2>\n\n\n\n<p class=\"has-text-align-justify\">While developers are now legally required to disclose the carpet area when measuring and pricing flats, provisions have been created for the measurement to be increased or decreased while a project is under construction. If the carpet area is lowered during construction, the developer is required to repay the extra cost to the customer within 45 days, plus yearly interest. If the carpet area is increased, the developer may require the buyer to pay the difference. The RERA, on the other hand, stipulates that the increase in carpet area cannot exceed 3%.<\/p>\n\n\n\n<h2 id=\"h-built-up-area\">Built-up Area<\/h2>\n\n\n\n<p class=\"has-text-align-justify\">The built-up area is the total size of the residential unit, which includes the carpet area as well as the thickness of the walls. This includes the area covered by the balcony or terrace. It usually accounts for roughly 70 to 80 percent of the estate&#8217;s super built-up area. It should be remembered that the proportion may differ depending on the project or builder. The built-up area, on the other hand, is created by adding 10 to 15% more room to the carpet area. Assuming a super built-up area of 1,200 square feet, the built-up area will be 70% or 80% of 1,200 square feet, or 840 square feet or 960 square feet, respectively, while the carpet area will be 588 square feet or 672 square feet.<\/p>\n\n\n\n<h3 id=\"h-calculate-the-built-up-area-using-this-formula\">Calculate the built-up area using this formula<\/h3>\n\n\n\n<p>Built-up area = carpet area + wall area + balcony area<\/p>\n\n\n\n<h3 id=\"h-carpet-area-vs-built-up-area-what-is-the-difference\">Carpet Area vs Built-up Area: What is the difference?<\/h3>\n\n\n\n<p class=\"has-text-align-justify\">Carpet area refers to the space that may be covered by a carpet, whereas built-up area refers to the area that remains after the carpet.<\/p>\n\n\n\n<h2 id=\"h-super-built-up-area\">Super Built-up Area<\/h2>\n\n\n\n<p class=\"has-text-align-justify\">The super built-up area is the total of the built-up area plus the space used by common spaces such as the lobby, stairwell, lift, shafts, and clubhouse, among other things. Developers frequently charge consumers depending on this area to recoup their building costs. As a result, it is known as the &#8220;saleable&#8221; area. The loading factor, which is the proportionate share of the common space in a flat derived by multiplying the carpet area by a multiplier (1.25), is closely linked to the super built-up area. This equates to a 25% or 30% increase in total saleable area. The difference between the super built-up area and the carpet area is used to calculate its value. The loading factor is used by many builders to determine the pricing of a unit.<\/p>\n\n\n\n<p class=\"has-text-align-justify\">Developers frequently utilized the super-built-up area as the space-measuring unit before the RERA made it necessary for them to sell apartments based on carpet area, to take advantage of the lack of clarity on space computation. They were able to reduce the properties per Sq. Ft cost by using a super built-up area as the measurement unit. It also gave the customer the idea that they were purchasing a huge home when they weren&#8217;t.<\/p>\n\n\n\n<p class=\"has-text-align-justify\">Since it becomes a benchmark for builders to charge their customers, the super built-up area is also known as the saleable area,” says Vijay Verma, CEO, Sunworld Group. The computation of a super built-up area is done differently when there is more than one unit on a level, he says.<\/p>\n\n\n\n<p class=\"has-text-align-justify\">Assume a residence with a carpet area of 1,000 square feet that costs ₹2,000 per square foot. The total cost of the property, in this case, will be ₹20,00,000. A builder will give the super built-up area (let&#8217;s say, 1,300 sq. ft) and price the home cheaper at, say, ₹1,800 per Sq. Ft to make the marketing pitch even more appealing. In this case, the property&#8217;s total price will be ₹23.40 lakhs. The latter would sound far more appealing to an uninformed consumer than the former.<\/p>\n\n\n\n<h3 id=\"h-calculate-the-super-built-up-area-using-this-formula\">Calculate the super built-up area using this formula<\/h3>\n\n\n\n<p><strong>Built-up area + proportional common area = super built-up area.<\/strong><\/p>\n\n\n\n<p><strong>Or<\/strong><\/p>\n\n\n\n<p><strong>Carpet&nbsp;area (1+loading factor) = Super built-up area<\/strong><\/p>\n\n\n\n<p class=\"has-text-align-justify\"><strong>Remember:<\/strong> Based on the developer and the specific location, the loading might be anywhere from 15 to 50 percent.<\/p>\n\n\n\n<h3 id=\"h-example-of-calculating-the-super-built-up-area\"><strong>Example of calculating the super built-up area<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-justify\">The super built-up area is computed differently when there are many units on a floor.<\/p>\n\n\n\n<p class=\"has-text-align-justify\">Suppose Rahul Patel owns a flat with a built-up area of 1,000 Sq. Ft on the fifth level of a housing society. Arun Prasad has a flat on the same level with a built-up area of 2,000 square feet. The floor&#8217;s entire common area is 1,500 square feet.<\/p>\n\n\n\n<p class=\"has-text-align-justify\">To calculate the super built-up area of the two flats the developer would split the built-up areas of the two flats by their ratio (in this example 1:2), then add 500 square feet to Patel&#8217;s total built-up area and 1,000 square feet to Prasad&#8217;s built-up area. Patel&#8217;s flat now has a super built-up size of 1,500 Sq. Ft, whereas Prasad&#8217;s has a super built-up area of 3,000 square feet.<\/p>\n\n\n\n<h2 id=\"h-can-purchasers-refuse-to-pay-for-a-developer-s-increase-in-carpet-area\"><strong>Can purchasers refuse to pay for a developer&#8217;s increase in carpet area?<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-justify\">Due to revisions in the plan and an increase in the carpet area, the developer has increased the overall price of the house on several occasions. The purchaser is responsible for the additional charges under RERA&#8217;s terms. In a case brought by Ashley Neil Serrao and Mark Clement Serrao, who had acquired a property in Runwal Greens by Propel Developers Pvt Ltd, the Maharashtra RERA has openly stated that the purchaser is responsible for paying the extra money.<\/p>\n\n\n\n<h2 id=\"h-how-to-determine-the-area-of-your-future-home-s-usable-space\"><strong>How to determine the area of your future home&#8217;s usable space?<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-justify\">Always inquire about the carpet area of the apartment and base your price negotiations on this figure. You could seek the assistance of a private technical assessor to re-confirm the carpet area in the apartment so that there is no room for any deception. Those who purchase a home with the aid of housing financing are in a stronger position since the bank will send its own legal and technical assessors to inspect the property&#8217;s specifications.<\/p>\n\n\n\n<p class=\"has-text-align-justify\">Another thing to keep in mind is that even if a developer quotes the price of a home-based on carpet area, they will almost always increase per Sq. Ft cost to account for the built-up and super built-up areas. Try to find out how much similar projects in the region cost to see whether the amount your builder offered is reasonable. If not, the buyer has the option of negotiating the agreement and attempting to lower the pricing.<\/p>\n\n\n\n<h2 id=\"h-few-more-terms\"><strong>Few More Terms<\/strong><\/h2>\n\n\n\n<h3 id=\"h-noc-no-objection-certificate\"><strong>NOC (No Objection Certificate)<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-justify\">A no objection certificate is a legal document that states that an individual or corporation has been granted authorization to purchase or build real estate.<\/p>\n\n\n\n<h3 id=\"h-occupancy-certificate-oc\"><strong>Occupancy certificate (OC)<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-justify\">The occupancy certificate is a crucial document that verifies that the building was built according to the approved designs and in accordance with local regulations. After verifying that all local laws have been followed, the local municipal corporation releases this document. The occupancy certificate must be obtained by the developer. When offering loans to property buyers, many financial firms require an occupancy certificate.<\/p>\n\n\n\n<h3 id=\"h-completion-certificate-cc\"><strong>Completion certificate (CC)<\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-justify\">A completion certification is a legal document that certifies that a new building has been erected and completed in accordance with the Buildings Act&#8217;s safety standards and regulations, as well as municipal legislation.<\/p>\n\n\n\n<h2 id=\"h-haryana-rera-has-issued-laws-requiring-flats-to-be-sold-only-based-on-carpet-area\"><strong>Haryana (RERA) has issued laws requiring flats to be sold only based on carpet area<\/strong><\/h2>\n\n\n\n<p class=\"has-text-align-justify\">On April 27, 2021, the Haryana Real Estate Regulatory Authority (HARERA) announced that developers can only offer flats in their developments based on carpet area. The state RERA declared that the selling of apartments on a super area or any other bench would be considered deceptive and an unfair commercial activity, and that developers who violated these instructions would face penalties. “In real estate developments, the property is not correctly represented by stating the super area without precisely describing and breaking down the components contained in the super area. “The practice of selling real estate on a super area basis is deceptive, imprecise, opaque, and leads to misunderstanding and difficulties, as well as unnecessary litigation,” stated KK Khandelwal, chairman of Haryana RERA.<\/p>\n\n\n\n<h2 id=\"h-you-might-also-like\">You Might Also Like<\/h2>\n\n\n\n<ul class=\"wp-block-yoast-seo-related-links\"><li><a href=\"https:\/\/www.squareyards.com\/blog\/some-of-the-key-terms-used-in-real-estate\">Some of the key terms used in Real Estate<\/a><\/li><li><a href=\"https:\/\/www.squareyards.com\/blog\/rera-carpet-area\">RERA Carpet Area: Things You Must Know About<\/a><\/li><li><a href=\"https:\/\/www.squareyards.com\/blog\/carpet-area-vs-built-up-area-vs-super-area\">Carpet area vs. built up area vs. super area<\/a><\/li><li><a href=\"https:\/\/www.squareyards.com\/blog\/how-carpet-area-definition-changes-in-rera\">How carpet area definition changes in RERA<\/a><\/li><li><a href=\"https:\/\/www.squareyards.com\/blog\/build-up-super-build-up\">Built up &amp; Super built up area<\/a><\/li><\/ul>\n\n\n\n<h2 id=\"h-frequently-asked-questions-faqs\">Frequently Asked Questions (FAQs)<\/h2>\n\n\n        <section class=\"sc_fs_faq sc_card\">\n            <div>\n\t\t\t\t<h2>What is the definition of carpet area?<\/h2>                <div>\n\t\t\t\t\t                    <p>\n\t\t\t\t\t\tThe carpet area is the area of the house that may be occupied by a carpet, omitting the thickness of the interior walls.                    <\/p>\n                <\/div>\n            <\/div>\n        <\/section>\n\t        <section class=\"sc_fs_faq sc_card\">\n            <div>\n\t\t\t\t<h2>What is the formula for calculating carpet area?<\/h2>                <div>\n\t\t\t\t\t                    <p>\n\t\t\t\t\t\tIf you know the precise built-up area, you can determine the carpet area.                    <\/p>\n                <\/div>\n            <\/div>\n        <\/section>\n\t        <section class=\"sc_fs_faq sc_card\">\n            <div>\n\t\t\t\t<h2>As per RERA, what is a carpet area?<\/h2>                <div>\n\t\t\t\t\t                    <p>\n\t\t\t\t\t\tAs per the RERA, carpet area is defined as &#8220;a house&#8217;s net usable floor space.&#8221;                    <\/p>\n                <\/div>\n            <\/div>\n        <\/section>\n\t        <section class=\"sc_fs_faq sc_card\">\n            <div>\n\t\t\t\t<h2>What is contained in the carpet area?<\/h2>                <div>\n\t\t\t\t\t                    <p>\n\t\t\t\t\t\tThe space covered by exterior walls, spaces beneath services shafts, exclusive balcony or verandah area, and exclusive open terrace area are not included in the carpet area.                    <\/p>\n                <\/div>\n            <\/div>\n        <\/section>\n\t        <section class=\"sc_fs_faq sc_card\">\n            <div>\n\t\t\t\t<h2>How can you figure out how much loading is on your carpet area?<\/h2>                <div>\n\t\t\t\t\t                    <p>\n\t\t\t\t\t\tIf a developer uses a loading factor of 1.25, it implies that the carpet area of the flat has been increased by 2%.                    <\/p>\n                <\/div>\n            <\/div>\n        <\/section>\n\t\n<script type=\"application\/ld+json\">\n    {\n        \"@context\": \"https:\/\/schema.org\",\n        \"@type\": \"FAQPage\",\n        \"mainEntity\": [\n                    {\n                \"@type\": \"Question\",\n                \"name\": \"What is the definition of carpet area?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"The carpet area is the area of the house that may be occupied by a carpet, omitting the thickness of the interior walls.\"\n                                    }\n            }\n            ,\t            {\n                \"@type\": \"Question\",\n                \"name\": \"What is the formula for calculating carpet area?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"If you know the precise built-up area, you can determine the carpet area.\"\n                                    }\n            }\n            ,\t            {\n                \"@type\": \"Question\",\n                \"name\": \"As per RERA, what is a carpet area?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"As per the RERA, carpet area is defined as \\\"a house's net usable floor space.\\\"\"\n                                    }\n            }\n            ,\t            {\n                \"@type\": \"Question\",\n                \"name\": \"What is contained in the carpet area?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"The space covered by exterior walls, spaces beneath services shafts, exclusive balcony or verandah area, and exclusive open terrace area are not included in the carpet area.\"\n                                    }\n            }\n            ,\t            {\n                \"@type\": \"Question\",\n                \"name\": \"How can you figure out how much loading is on your carpet area?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"If a developer uses a loading factor of 1.25, it implies that the carpet area of the flat has been increased by 2%.\"\n                                    }\n            }\n            \t        ]\n    }\n\n<\/script>","protected":false},"excerpt":{"rendered":"<p>Understanding the technical jargon used by real estate brokers is critical for potential homebuyers to prevent mistakes that might jeopardize their chances of acquiring the house of their dreams. In India, developers and agents frequently use the words carpet area, built-up area, and super built-up area, prompting many people to search for explanations on the [&hellip;]<\/p>\n","protected":false},"author":21,"featured_media":31399,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_editorskit_title_hidden":false,"_editorskit_reading_time":7,"_editorskit_typography_data":[],"_editorskit_blocks_typography":""},"categories":[4578],"_links":{"self":[{"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/posts\/31389"}],"collection":[{"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/users\/21"}],"replies":[{"embeddable":true,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/comments?post=31389"}],"version-history":[{"count":4,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/posts\/31389\/revisions"}],"predecessor-version":[{"id":31394,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/posts\/31389\/revisions\/31394"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/media\/31399"}],"wp:attachment":[{"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/media?parent=31389"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/categories?post=31389"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}