{"id":31401,"date":"2021-07-19T09:56:47","date_gmt":"2021-07-19T04:26:47","guid":{"rendered":"https:\/\/www.squareyards.com\/blog\/?p=31401"},"modified":"2021-07-19T09:56:54","modified_gmt":"2021-07-19T04:26:54","slug":"adm-capital-invests-25-million-in-square-yards","status":"publish","type":"post","link":"https:\/\/www.squareyards.com\/blog\/adm-capital-invests-25-million-in-square-yards","title":{"rendered":"ADM Capital invests $25 million in Square Yards"},"content":{"rendered":"<p style=\"text-align: justify\">Square Yards, the country’s foremost integrated real estate platform, based in Gurugram, has raised $25 million or approximately Rs. 185 crore from global investment manager ADM Capital which currently has $2.4 billion of assets under management throughout Europe and the Asia Pacific. This new infusion of growth capital is the first tranche of Square Yards’ ongoing goals of raising more than $100 million in capital in the near future. The company will be using this capital to continue expansion and investments in several verticals throughout the entire value chain.<\/p>\n<p style=\"text-align: justify\">The Founder &amp; CEO at Square Yards, Tanuj Shori, stated that Square Yard has been mostly capital efficient from inception with a clear emphasis on ensuring higher ROI. The company has met important operational benchmarks over the last year including profitability and also the pilot success of its new ventures like home interiors, property management and rentals among others. He added that Square Yards is now at the cusp of accelerating further growth while adding that with a stronger institutional partner such as ADM Capital, the company can push forward aggressively towards accomplishing both personal and brand investments with a view towards ensuring a swifter growth trajectory.<\/p>\n<p style=\"text-align: justify\">Square Yards is already developing an integrated service ecosystem both inorganically and organically. It acquired platform capabilities recently in data intelligence, VR and property management\/rentals while launching a full service platform that offers home interior and home furnishing solutions. The Co-Founding Partner and Joint Chief Investment Officer, ADM Capital, Christopher Botsford, stated that they are happy to back Square Yards in its future growth pursuits and will continue looking for more opportunities to support leading Indian corporates who are aiming at disrupting conventional industries. He added that the company is also happy with the willingness of Square Yards to scale up its social and environmental policies and can share expertise, taking ADM Capital’s proven capabilities of enhancing borrower governance and mitigation of ESG risks into account.<\/p>\n<p style=\"text-align: justify\">ADM Capital was founded in 1998, offering flexible credit options to top midsized corporates in the Asia Pacific. ADM Capital forayed into the Indian market around 2004 and has since deployed more than $670 million throughout 18 private financings. ADM Capital emphasizes greatly on stronger corporate governance and social and environmental compliance alike. Integrated strategies have been influencing the proptech space globally and top entities like Compass, Zillow and Beike are building digital integrated consumer experiences spanning all transactional aspects involving the buy-and-sell part, helping them capture a bigger slice of the entire transaction. Square Yards has been pioneering an integrated ecosystem based model and is one of the few global realty platforms that provide the entire full stack digital realty journey encompassing transactions, search and discovery, home interiors, mortgages, property management, rentals and after-sales services. Square Yards also provides B2B SaaS solutions for real estate developers, banks, realty agents and financial institutions.<\/p>\n<p>To find out what our Founder and CEO, Mr. Tanuj Shori has in the plan, please click on the following media coverages:<\/p>\n<p>moneycontrol.com &#8211; https:\/\/bit.ly\/3z9KI0J<br \/>The Economic Times &#8211; https:\/\/bit.ly\/3xQPUGE<br \/>Inc42 &#8211; https:\/\/bit.ly\/3zanhV7<br \/>YourStory &#8211; https:\/\/bit.ly\/3km8aUl<br \/>VCCIRCLE &#8211; https:\/\/bit.ly\/3xKP26e<br \/>Outlookindia &#8211; https:\/\/bit.ly\/3ilnw8X<br \/>BW Disrupt &#8211; https:\/\/bit.ly\/3emp1ST<br \/>TechCircle &#8211; https:\/\/bit.ly\/3B8Yl1S<br \/>Asian News &#8211; https:\/\/bit.ly\/2UiaCR1<br \/>ConstructionWeekOnline &#8211; https:\/\/bit.ly\/36Ge4aU<br \/>Realty Plus &#8211; https:\/\/bit.ly\/3kt0Nu5<br \/>Realty NXT &#8211; https:\/\/bit.ly\/3BgxJfg<\/p>\n<p><strong>Published Date: July 16, 2021<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Square Yards, the country’s foremost integrated real estate platform, based in Gurugram, has raised $25 million or approximately Rs. 185 crore from global investment manager ADM Capital which currently has $2.4 billion of assets under management throughout Europe and the Asia Pacific. This new infusion of growth capital is the first tranche of Square Yards’ [&hellip;]<\/p>\n","protected":false},"author":11,"featured_media":31403,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_editorskit_title_hidden":false,"_editorskit_reading_time":2,"_editorskit_typography_data":[],"_editorskit_blocks_typography":""},"categories":[234],"_links":{"self":[{"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/posts\/31401"}],"collection":[{"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/users\/11"}],"replies":[{"embeddable":true,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/comments?post=31401"}],"version-history":[{"count":3,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/posts\/31401\/revisions"}],"predecessor-version":[{"id":31405,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/posts\/31401\/revisions\/31405"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/media\/31403"}],"wp:attachment":[{"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/media?parent=31401"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.squareyards.com\/blog\/wp-json\/wp\/v2\/categories?post=31401"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}